function [p] = stamp(m)
%UNTITLED 循环计算印花问题的概率
%   印花种类数定为12，m为买烟包数

p=0;

for x0=1:m-11
    for x1=1:m-x0-10
        for x2=1:m-x0-x1-9
            for x3=1:m-x0-x1-x2-8
                for x4=1:m-x0-x1-x2-x3-7
                    for x5=1:m-x0-x1-x2-x3-x4-6
                        for x6=1:m-x0-x1-x2-x3-x4-x5-5
                            for x7=1:m-x0-x1-x2-x3-x4-x5-x6-4
                                for x8=1:m-x0-x1-x2-x3-x4-x5-x6-x7-3
                                    for x9=1:m-x0-x1-x2-x3-x4-x5-x6-x7-x8-2
                                        for x10=1:m-x0-x1-x2-x3-x4-x5-x6-x7-x8-x9-1
                                            for x11=m-x0-x1-x2-x3-x4-x5-x6-x7-x8-x9-x10:m-x0-x1-x2-x3-x4-x5-x6-x7-x8-x9-x10
                                                p=p+(1e-8)^(x0-1)*(1/12)^(x1-1)*(1-1/12)*(2/12)^(x2-1)*(1-2/12)*(3/12)^(x3-1)*(1-3/12)*(4/12)^(x4-1)*(1-4/12)*(5/12)^(x5-1)*(1-5/12)*(6/12)^(x6-1)*(1-6/12)*(7/12)^(x7-1)*(1-7/12)*(8/12)^(x8-1)*(1-8/12)*(9/12)^(x9-1)*(1-9/12)*(10/12)^(x10-1)*(1-10/12)*(11/12)^(x11-1)*(1-11/12);
                                            end
                                        end
                                    end
                                end
                            end
                        end
                    end
                end
            end
        end
    end
end

end